{
  "text": "a booth? No, we have the same all the time. We work here in Dublin and sometimes it gets a little bit hairy. It comes up to the time, you're still running around the floor frantically trying to find somewhere to jump into. I hope the young fella's okay after yesterday as well. Oh yeah, he's fine, he's fine. He was just being a bit silly. He was a bit like unsettled, I suppose, so it was better for him for us to come and pick him up. But he's absolutely fine today. Thanks for moving there. No problem at all. We have been able to look at pricing. I met my director there and went through it all. We have two options. Let me share my screen here. One second. The pricing I've included here is, as we had discussed, the internal platform and the external platform. It was 20 internal viewers and 350 external viewers. I know you said in the last call that you had a budget around 50-60k. The first option here, we were able to discount quite heavily. It is a two-year contract. The first option is basically our end of quarter is in October. Now that we're coming into the second half of the quarter, we're able to get a little bit of a higher discount. What we're looking at is two options. If we are able to do it this quarter, or if we're able to do it next quarter, should everything go well. I suppose we'll go through it quickly. I'll go through the reasoning for each. Just to call out our usual terms, our standard is annual billing. If we need quarterly billing, that can be approved. I just need to go and have the conversation with the finance teams. Net 30. I don't know if you guys are on AWS, but we can bill through AWS as well, if you guys prefer. A lot of companies have a commit to AWS that they have to spend X amount. You can use Omni towards that. Sorry, say again? I was saying that's interesting. We are on AWS as well. Okay, yeah. We can bill completely through there. It just means that after contracts and stuff are signed, then we send a private offer through AWS and then everything is billed through it, which can make things easier. One of the terms that we always have in here is a 5% maximum renewal cap to be included in contract. We've seen a lot of tech companies, I'm not sure if you've come across it before, where they come in with a really heavily discounted offer. Then after year one, when you come to renewal, they hike it up 20%. This is basically saying that it's not a guaranteed 5% up list. If inflation goes up or a cost of business goes up or whatever, and we end up needing to put our prices up, the maximum we can do it is by 5%. We'll be contractually obligated to that. Okay. Just to protect you as well. To sign in Q3, what we've been able to do is apply these discounts here to all of our pricing. Essentially, it brings it up. We do have the training and enablement one-time fee in there with our partners, which would be a 30-hour package that will cover training and enablement both for developers and non-technical users. At the same time, they can help build out your model, build any external dashboards, they can help with embedding, etc. We do highly recommend that people go with that. The people that we see going with that generally have an easier onboarding and a quicker time to value. After we take that out from year one, that's coming in at the lower end of the budget. You said it's usually 50 to 60k. We've been able to get it down as far as there. If it isn't possible to do it by October, and we do end up signing in Q4, we're still able to get some discounts in there, but it's coming up a little higher. It's just at the higher end of your budget, coming in at 60 to 400 altogether. I'm not sure if I said it last time, included in this is chat support via Slack. If you were to start an evaluation with us, we'd open up a Slack channel with myself, Connor, our support team, and that'll be your primary support channel. Our median response time over Slack at the moment is four to five minutes, so a really responsive support team there. Does that all make sense? I'll obviously send that over to you, but is that all clear enough? That makes sense, yes. Thank you for that. Any feedback or how is that aligning with expectations or where Tableau or other vendors might have quoted you? I suppose it's roughly in line with expectations. I really appreciate the discount. I was slightly worried it was going to be way above that. Originally, when we put the numbers in, it was, but look, we're growing our business as well. Clipped is a company and a brand that we would love to partner with, so there's a lot of that behind it as well. Okay. All right. No, that's great. Very much appreciated. I suppose the only thing that I just want to add is in terms of the context, we're at a point where we're keeping quite a close eye on our costs, particularly from a SaaS perspective. So in terms of this, it definitely very much needs to be in through the lens of how does that mitigate some of our spend in Tableau basically and some of our other tools potentially. So I just want to make sure that we're setting the expectations right. People have asked about reducing the Tableau bill and this will be a little bit of a reduction, but maybe not. Quite in line with what they're hoping for. Now, I think that there's obviously the case to be made that this is a significantly better tool than something else that we would change to, to embed that analytics. I think that's the conversation that we kind of need to have. But just so that you're aware of that, that's kind of where we are at the moment. Like I said last time, it is very much the thing that kind of, I remember, I think I gave this the feedback to Mark last year, which is we're at a point where we could invest quite so heavily in the tool and that's why we went for Metabase. But I think that definitely kind of piqued my interest again on top of the fact that I just really liked the tool was this topic of the Tableau costs kind of came up again. It was like, if you offer the embedded option, how does that sort of work when we're thinking about improving our tooling whilst absorbing some of that cost, etc. So yeah, but no, I really appreciate you taking me through it. And yeah, the discounts are great. So I'll have the chat internally and we'll see where we get to. Yeah, no problem. No problem. I'm sorry. One thing I meant to say in here is contract signed before October 14th. I'll actually put this in. You said your Tableau renewal is mid-December, right? Yeah, it is, yeah. So I meant to actually explain this. So that's just contract signature. We would push out the contract start date and any billing until your current Tableau contract is up. So essentially, if you sign this in October, you'd have October, November for free, and then it'll only kick in when your Tableau contract is over. And essentially what it means is it gives you a bit of runway to kind of set everything up, have everything ready to go from an internal standpoint and as well as an external point of view. It's kind of a two-month runway to set everything up so that it's a very easy transition. Perfect. Okay. Yeah, thanks for that. I'll just put in, I'll add that note in properly when I send it over. Yes. Start date to December. And I suppose on that point as well, it'd be good to kind of understand then. So kind of two things I would say there is like, look, if we need to take another pass at us, what I would suggest is maybe kind of going into an evaluation and seeing where the value is being added. And then if it's something that, you know, is a really, really good fit, but it's just not something that's going to be approved by the business, then at that point maybe we can kind of look at where the value lies, where the value is missing, and if there's anything else we need to do. Yes. It'd also be great to understand then kind of from the rest of the business, like if we kind of, from the rest of the business then it'd be good to kind of think about where do they need to see the value added in order to justify the 50k a year, right? Which is essentially probably what would be going into your own proposal. But if we have a kind of understanding of that, then we can definitely kind of work towards making sure that that value is fulfilled. Yes. Okay. No, that makes sense. Yeah. Okay, great. Well, look, what I'll do is I will send over this PDF. Keep in touch. Yeah, let us know. Especially if Tableau kind of start coming back with any kind of, like as I said, we'd really like to work with you guys, so if Tableau start coming back with the reasons to fire on with them and not go into an Omni POC, that's totally fine as well, but let us know and I can see where we can still add value against it. Yes. Okay. Perfect. Sounds good. Thanks. Thanks so much for that. Yeah, no problem. No problem. Well, look, okay, that's great. Let me know. Yeah, I might see you if you're heading up to Big Data London next week. I'm hoping to, yes. Yeah. Well, I might see you there. I sent you on the link for the Data Leaders Dinner in the Belvedere the night before, so if you can make it, it'd be great to see you. If not, we actually have, so right by the conference, there's a pub called the Albion and we have that booked out both days from half 12 onwards as a kind of escape from Big Data London kind of thing, so if at any point you want to get out of there and go over and grab a bite to eat or a pint around and let us know, we can sort that out for you. Nice. Thanks, Kevin. All right. Perfect. All right. Thanks, Chris. I appreciate your time and I'll see you soon. Thank you. Thanks, Kevin. Bye. Bye.",
  "language": "english",
  "duration": 733.6799926757812,
  "segments": [
    {
      "id": 0,
      "start": 0.0,
      "end": 8.0,
      "text": " a booth? No, we have the same all the time. We work here in Dublin and sometimes it gets"
    },
    {
      "id": 1,
      "start": 8.0,
      "end": 12.279999732971191,
      "text": " a little bit hairy. It comes up to the time, you're still running around the floor frantically"
    },
    {
      "id": 2,
      "start": 12.279999732971191,
      "end": 19.079999923706055,
      "text": " trying to find somewhere to jump into. I hope the young fella's okay after yesterday as"
    },
    {
      "id": 3,
      "start": 19.079999923706055,
      "end": 29.280000686645508,
      "text": " well. Oh yeah, he's fine, he's fine. He was just being a bit silly. He was a bit like"
    },
    {
      "id": 4,
      "start": 29.280000686645508,
      "end": 34.2400016784668,
      "text": " unsettled, I suppose, so it was better for him for us to come and pick him up. But he's"
    },
    {
      "id": 5,
      "start": 34.2400016784668,
      "end": 45.84000015258789,
      "text": " absolutely fine today. Thanks for moving there. No problem at all. We have been able to look"
    },
    {
      "id": 6,
      "start": 45.84000015258789,
      "end": 55.79999923706055,
      "text": " at pricing. I met my director there and went through it all. We have two options. Let me"
    },
    {
      "id": 7,
      "start": 55.79999923706055,
      "end": 70.63999938964844,
      "text": " share my screen here. One second. The pricing I've included here is, as we had discussed,"
    },
    {
      "id": 8,
      "start": 70.63999938964844,
      "end": 79.36000061035156,
      "text": " the internal platform and the external platform. It was 20 internal viewers and 350 external"
    },
    {
      "id": 9,
      "start": 79.36000061035156,
      "end": 86.44000244140625,
      "text": " viewers. I know you said in the last call that you had a budget around 50-60k. The"
    },
    {
      "id": 10,
      "start": 86.44000244140625,
      "end": 94.63999938964844,
      "text": " first option here, we were able to discount quite heavily. It is a two-year contract."
    },
    {
      "id": 11,
      "start": 94.63999938964844,
      "end": 102.83999633789062,
      "text": " The first option is basically our end of quarter is in October. Now that we're coming into"
    },
    {
      "id": 12,
      "start": 102.83999633789062,
      "end": 108.76000213623047,
      "text": " the second half of the quarter, we're able to get a little bit of a higher discount."
    },
    {
      "id": 13,
      "start": 109.08000183105469,
      "end": 113.87999725341797,
      "text": " What we're looking at is two options. If we are able to do it this quarter, or if we're able to"
    },
    {
      "id": 14,
      "start": 113.87999725341797,
      "end": 122.87999725341797,
      "text": " do it next quarter, should everything go well. I suppose we'll go through it quickly. I'll go"
    },
    {
      "id": 15,
      "start": 122.87999725341797,
      "end": 130.67999267578125,
      "text": " through the reasoning for each. Just to call out our usual terms, our standard is annual billing."
    },
    {
      "id": 16,
      "start": 130.67999267578125,
      "end": 135.75999450683594,
      "text": " If we need quarterly billing, that can be approved. I just need to go and have the"
    },
    {
      "id": 17,
      "start": 135.75999450683594,
      "end": 140.9600067138672,
      "text": " conversation with the finance teams. Net 30. I don't know if you guys are on AWS, but we can"
    },
    {
      "id": 18,
      "start": 140.9600067138672,
      "end": 150.67999267578125,
      "text": " bill through AWS as well, if you guys prefer. A lot of companies have a commit to AWS that they"
    },
    {
      "id": 19,
      "start": 150.67999267578125,
      "end": 157.32000732421875,
      "text": " have to spend X amount. You can use Omni towards that. Sorry, say again?"
    },
    {
      "id": 20,
      "start": 157.32000732421875,
      "end": 160.24000549316406,
      "text": " I was saying that's interesting. We are on AWS as well."
    },
    {
      "id": 21,
      "start": 161.0800018310547,
      "end": 167.44000244140625,
      "text": " Okay, yeah. We can bill completely through there. It just means that after contracts and stuff are"
    },
    {
      "id": 22,
      "start": 167.44000244140625,
      "end": 175.0399932861328,
      "text": " signed, then we send a private offer through AWS and then everything is billed through it, which"
    },
    {
      "id": 23,
      "start": 175.0399932861328,
      "end": 182.24000549316406,
      "text": " can make things easier. One of the terms that we always have in here is a 5% maximum renewal cap to"
    },
    {
      "id": 24,
      "start": 182.24000549316406,
      "end": 189.24000549316406,
      "text": " be included in contract. We've seen a lot of tech companies, I'm not sure if you've come across it"
    },
    {
      "id": 25,
      "start": 189.24000549316406,
      "end": 194.0800018310547,
      "text": " before, where they come in with a really heavily discounted offer. Then after year one, when you"
    },
    {
      "id": 26,
      "start": 194.0800018310547,
      "end": 202.52000427246094,
      "text": " come to renewal, they hike it up 20%. This is basically saying that it's not a guaranteed 5%"
    },
    {
      "id": 27,
      "start": 202.52000427246094,
      "end": 210.0,
      "text": " up list. If inflation goes up or a cost of business goes up or whatever, and we end up needing to put"
    },
    {
      "id": 28,
      "start": 210.0,
      "end": 216.67999267578125,
      "text": " our prices up, the maximum we can do it is by 5%. We'll be contractually obligated to that."
    },
    {
      "id": 29,
      "start": 217.67999267578125,
      "end": 218.67999267578125,
      "text": " Okay."
    },
    {
      "id": 30,
      "start": 218.67999267578125,
      "end": 227.1999969482422,
      "text": " Just to protect you as well. To sign in Q3, what we've been able to do is apply these discounts here"
    },
    {
      "id": 31,
      "start": 227.1999969482422,
      "end": 233.9199981689453,
      "text": " to all of our pricing. Essentially, it brings it up. We do have the training and enablement one-time"
    },
    {
      "id": 32,
      "start": 233.9199981689453,
      "end": 240.9600067138672,
      "text": " fee in there with our partners, which would be a 30-hour package that will cover training and"
    },
    {
      "id": 33,
      "start": 241.0800018310547,
      "end": 249.83999633789062,
      "text": " enablement both for developers and non-technical users. At the same time, they can help build out"
    },
    {
      "id": 34,
      "start": 249.83999633789062,
      "end": 256.32000732421875,
      "text": " your model, build any external dashboards, they can help with embedding, etc. We do highly recommend"
    },
    {
      "id": 35,
      "start": 256.32000732421875,
      "end": 261.32000732421875,
      "text": " that people go with that. The people that we see going with that generally have an easier onboarding"
    },
    {
      "id": 36,
      "start": 261.32000732421875,
      "end": 270.2799987792969,
      "text": " and a quicker time to value. After we take that out from year one, that's coming in at"
    },
    {
      "id": 37,
      "start": 271.0,
      "end": 277.1600036621094,
      "text": " the lower end of the budget. You said it's usually 50 to 60k. We've been able to get it down as far"
    },
    {
      "id": 38,
      "start": 277.1600036621094,
      "end": 291.6400146484375,
      "text": " as there. If it isn't possible to do it by October, and we do end up signing in Q4, we're still able"
    },
    {
      "id": 39,
      "start": 291.6400146484375,
      "end": 297.7200012207031,
      "text": " to get some discounts in there, but it's coming up a little higher. It's just at the higher end"
    },
    {
      "id": 40,
      "start": 297.7200012207031,
      "end": 305.0,
      "text": " of your budget, coming in at 60 to 400 altogether. I'm not sure if I said it last time, included in"
    },
    {
      "id": 41,
      "start": 305.0,
      "end": 312.20001220703125,
      "text": " this is chat support via Slack. If you were to start an evaluation with us, we'd open up a Slack"
    },
    {
      "id": 42,
      "start": 312.20001220703125,
      "end": 320.20001220703125,
      "text": " channel with myself, Connor, our support team, and that'll be your primary support channel."
    },
    {
      "id": 43,
      "start": 321.239990234375,
      "end": 324.9200134277344,
      "text": " Our median response time over Slack at the moment is four to five minutes,"
    },
    {
      "id": 44,
      "start": 325.7200012207031,
      "end": 330.67999267578125,
      "text": " so a really responsive support team there."
    },
    {
      "id": 45,
      "start": 331.7200012207031,
      "end": 337.8800048828125,
      "text": " Does that all make sense? I'll obviously send that over to you,"
    },
    {
      "id": 46,
      "start": 337.8800048828125,
      "end": 342.5199890136719,
      "text": " but is that all clear enough? That makes sense, yes. Thank you for that."
    },
    {
      "id": 47,
      "start": 343.32000732421875,
      "end": 349.7200012207031,
      "text": " Any feedback or how is that aligning with expectations or where Tableau or other vendors"
    },
    {
      "id": 48,
      "start": 349.7200012207031,
      "end": 356.2799987792969,
      "text": " might have quoted you? I suppose it's roughly in line with expectations."
    },
    {
      "id": 49,
      "start": 356.2799987792969,
      "end": 361.0799865722656,
      "text": " I really appreciate the discount. I was slightly worried it was going to be way above that."
    },
    {
      "id": 50,
      "start": 361.0799865722656,
      "end": 369.0,
      "text": " Originally, when we put the numbers in, it was, but look, we're growing our business as well."
    },
    {
      "id": 51,
      "start": 369.0,
      "end": 374.2799987792969,
      "text": " Clipped is a company and a brand that we would love to partner with, so there's a lot of that behind"
    },
    {
      "id": 52,
      "start": 374.3599853515625,
      "end": 380.2799987792969,
      "text": " it as well. Okay. All right. No, that's great. Very much appreciated. I suppose the only thing"
    },
    {
      "id": 53,
      "start": 380.2799987792969,
      "end": 388.0400085449219,
      "text": " that I just want to add is in terms of the context, we're at a point where we're keeping"
    },
    {
      "id": 54,
      "start": 388.0400085449219,
      "end": 394.8399963378906,
      "text": " quite a close eye on our costs, particularly from a SaaS perspective. So in terms of this,"
    },
    {
      "id": 55,
      "start": 394.8399963378906,
      "end": 401.239990234375,
      "text": " it definitely very much needs to be in through the lens of how does that mitigate some of our"
    },
    {
      "id": 56,
      "start": 401.239990234375,
      "end": 408.6000061035156,
      "text": " spend in Tableau basically and some of our other tools potentially. So I just want to make"
    },
    {
      "id": 57,
      "start": 408.6000061035156,
      "end": 416.9200134277344,
      "text": " sure that we're setting the expectations right. People have asked about"
    },
    {
      "id": 58,
      "start": 416.9200134277344,
      "end": 422.0400085449219,
      "text": " reducing the Tableau bill and this will be a little bit of a reduction, but maybe not."
    },
    {
      "id": 59,
      "start": 422.0400085449219,
      "end": 426.9200134277344,
      "text": " Quite in line with what they're hoping for. Now, I think that there's obviously the"
    },
    {
      "id": 60,
      "start": 426.9200134277344,
      "end": 433.0,
      "text": " case to be made that this is a significantly better tool than something else that we would"
    },
    {
      "id": 61,
      "start": 433.0,
      "end": 439.4800109863281,
      "text": " change to, to embed that analytics. I think that's the conversation that we kind of need to have."
    },
    {
      "id": 62,
      "start": 439.4800109863281,
      "end": 444.3599853515625,
      "text": " But just so that you're aware of that, that's kind of where we are at the moment. Like I said"
    },
    {
      "id": 63,
      "start": 444.3599853515625,
      "end": 450.1199951171875,
      "text": " last time, it is very much the thing that kind of, I remember, I think I gave this the feedback to"
    },
    {
      "id": 64,
      "start": 450.1199951171875,
      "end": 454.2799987792969,
      "text": " Mark last year, which is we're at a point where we could invest quite so heavily in the tool"
    },
    {
      "id": 65,
      "start": 454.760009765625,
      "end": 458.760009765625,
      "text": " and that's why we went for Metabase. But I think that definitely kind of"
    },
    {
      "id": 66,
      "start": 459.8800048828125,
      "end": 463.0,
      "text": " piqued my interest again on top of the fact that I just really liked the tool was"
    },
    {
      "id": 67,
      "start": 463.7200012207031,
      "end": 469.4800109863281,
      "text": " this topic of the Tableau costs kind of came up again. It was like, if you offer"
    },
    {
      "id": 68,
      "start": 469.4800109863281,
      "end": 475.79998779296875,
      "text": " the embedded option, how does that sort of work when we're thinking about improving"
    },
    {
      "id": 69,
      "start": 475.79998779296875,
      "end": 482.760009765625,
      "text": " our tooling whilst absorbing some of that cost, etc. So yeah, but no, I really"
    },
    {
      "id": 70,
      "start": 482.760009765625,
      "end": 488.67999267578125,
      "text": " appreciate you taking me through it. And yeah, the discounts are great. So I'll"
    },
    {
      "id": 71,
      "start": 488.67999267578125,
      "end": 493.4800109863281,
      "text": " have the chat internally and we'll see where we get to. Yeah, no problem. No problem."
    },
    {
      "id": 72,
      "start": 493.4800109863281,
      "end": 498.20001220703125,
      "text": " I'm sorry. One thing I meant to say in here is contract signed before October 14th. I'll actually"
    },
    {
      "id": 73,
      "start": 498.20001220703125,
      "end": 505.32000732421875,
      "text": " put this in. You said your Tableau renewal is mid-December, right? Yeah, it is, yeah."
    },
    {
      "id": 74,
      "start": 505.32000732421875,
      "end": 511.32000732421875,
      "text": " So I meant to actually explain this. So that's just contract signature. We would push out the"
    },
    {
      "id": 75,
      "start": 511.32000732421875,
      "end": 517.7999877929688,
      "text": " contract start date and any billing until your current Tableau contract is up. So essentially,"
    },
    {
      "id": 76,
      "start": 517.7999877929688,
      "end": 524.4400024414062,
      "text": " if you sign this in October, you'd have October, November for free, and then it'll only kick in"
    },
    {
      "id": 77,
      "start": 525.9600219726562,
      "end": 532.8400268554688,
      "text": " when your Tableau contract is over. And essentially what it means is it gives you"
    },
    {
      "id": 78,
      "start": 532.8400268554688,
      "end": 538.1199951171875,
      "text": " a bit of runway to kind of set everything up, have everything ready to go from an internal"
    },
    {
      "id": 79,
      "start": 538.1199951171875,
      "end": 541.3200073242188,
      "text": " standpoint and as well as an external point of view. It's kind of a two-month runway to set"
    },
    {
      "id": 80,
      "start": 541.3200073242188,
      "end": 548.0399780273438,
      "text": " everything up so that it's a very easy transition. Perfect. Okay. Yeah, thanks for that."
    },
    {
      "id": 81,
      "start": 549.3200073242188,
      "end": 561.8800048828125,
      "text": " I'll just put in, I'll add that note in properly when I send it over. Yes. Start date to December."
    },
    {
      "id": 82,
      "start": 561.8800048828125,
      "end": 573.719970703125,
      "text": " And I suppose on that point as well, it'd be good to kind of understand then. So kind of two"
    },
    {
      "id": 83,
      "start": 573.719970703125,
      "end": 576.6799926757812,
      "text": " things I would say there is like, look, if we need to take another pass at us,"
    },
    {
      "id": 84,
      "start": 579.239990234375,
      "end": 585.1599731445312,
      "text": " what I would suggest is maybe kind of going into an evaluation and seeing where the value is being"
    },
    {
      "id": 85,
      "start": 585.1599731445312,
      "end": 589.3200073242188,
      "text": " added. And then if it's something that, you know, is a really, really good fit, but it's just"
    },
    {
      "id": 86,
      "start": 590.2000122070312,
      "end": 596.280029296875,
      "text": " not something that's going to be approved by the business, then at that point maybe we can kind of"
    },
    {
      "id": 87,
      "start": 596.280029296875,
      "end": 600.1199951171875,
      "text": " look at where the value lies, where the value is missing, and if there's anything else we need to"
    },
    {
      "id": 88,
      "start": 600.1199951171875,
      "end": 608.5999755859375,
      "text": " do. Yes. It'd also be great to understand then kind of from the rest of the business, like if we"
    },
    {
      "id": 89,
      "start": 608.5999755859375,
      "end": 614.4400024414062,
      "text": " kind of, from the rest of the business then it'd be good to kind of think about where do they need"
    },
    {
      "id": 90,
      "start": 614.4400024414062,
      "end": 621.7999877929688,
      "text": " to see the value added in order to justify the 50k a year, right? Which is essentially probably"
    },
    {
      "id": 91,
      "start": 623.3200073242188,
      "end": 627.0800170898438,
      "text": " what would be going into your own proposal. But if we have a kind of understanding of that,"
    },
    {
      "id": 92,
      "start": 627.0800170898438,
      "end": 631.3200073242188,
      "text": " then we can definitely kind of work towards making sure that that value is fulfilled."
    },
    {
      "id": 93,
      "start": 632.1199951171875,
      "end": 641.239990234375,
      "text": " Yes. Okay. No, that makes sense. Yeah. Okay, great. Well, look, what I'll do is"
    },
    {
      "id": 94,
      "start": 642.2000122070312,
      "end": 651.4000244140625,
      "text": " I will send over this PDF. Keep in touch. Yeah, let us know. Especially if Tableau kind of"
    },
    {
      "id": 95,
      "start": 651.4000244140625,
      "end": 656.5999755859375,
      "text": " start coming back with any kind of, like as I said, we'd really like to work with you guys,"
    },
    {
      "id": 96,
      "start": 656.5999755859375,
      "end": 664.5999755859375,
      "text": " so if Tableau start coming back with the reasons to fire on with them and not go into an Omni POC,"
    },
    {
      "id": 97,
      "start": 664.6799926757812,
      "end": 671.8800048828125,
      "text": " that's totally fine as well, but let us know and I can see where we can still add value against it."
    },
    {
      "id": 98,
      "start": 672.8400268554688,
      "end": 675.6400146484375,
      "text": " Yes. Okay. Perfect. Sounds good. Thanks. Thanks so much for that."
    },
    {
      "id": 99,
      "start": 676.5999755859375,
      "end": 682.760009765625,
      "text": " Yeah, no problem. No problem. Well, look, okay, that's great. Let me know. Yeah, I might see you"
    },
    {
      "id": 100,
      "start": 682.760009765625,
      "end": 687.719970703125,
      "text": " if you're heading up to Big Data London next week. I'm hoping to, yes."
    },
    {
      "id": 101,
      "start": 688.280029296875,
      "end": 694.760009765625,
      "text": " Yeah. Well, I might see you there. I sent you on the link for the Data Leaders Dinner in the"
    },
    {
      "id": 102,
      "start": 694.760009765625,
      "end": 699.3200073242188,
      "text": " Belvedere the night before, so if you can make it, it'd be great to see you. If not, we actually"
    },
    {
      "id": 103,
      "start": 699.3200073242188,
      "end": 705.4000244140625,
      "text": " have, so right by the conference, there's a pub called the Albion and we have that booked out"
    },
    {
      "id": 104,
      "start": 705.4000244140625,
      "end": 710.3599853515625,
      "text": " both days from half 12 onwards as a kind of escape from Big Data London kind of thing,"
    },
    {
      "id": 105,
      "start": 710.3599853515625,
      "end": 714.5999755859375,
      "text": " so if at any point you want to get out of there and go over and grab a bite to eat or"
    },
    {
      "id": 106,
      "start": 714.5999755859375,
      "end": 720.0399780273438,
      "text": " a pint around and let us know, we can sort that out for you. Nice. Thanks, Kevin. All right."
    },
    {
      "id": 107,
      "start": 720.0399780273438,
      "end": 724.760009765625,
      "text": " Perfect. All right. Thanks, Chris. I appreciate your time and I'll see you soon. Thank you."
    },
    {
      "id": 108,
      "start": 724.760009765625,
      "end": 727.6400146484375,
      "text": " Thanks, Kevin. Bye. Bye."
    }
  ]
}